describe('Тести для компонента HomePage', () => {
    beforeEach(() => {
        // Відкриваємо домашню сторінку перед кожним тестом
        cy.visit('http://localhost:3000/');
    });

    it('перевіряє наявність логотипу та тексту', () => {
        // Переконуємося, що логотип відображається
        cy.get('img[alt="Лого"]').should('exist');
        cy.get('img[alt="Новий логотип"]').should('exist');

        // Перевіряємо наявність тексту "Привіт! Вітаємо тебе на курсі"
        cy.contains('Привіт! Вітаємо тебе на курсі').should('exist');
    });

    it('перевіряє навігацію на сторінку "Про нас"', () => {
        cy.get('a').contains('Про нас').click();
        cy.url().should('include', '/about'); // Перевіряємо, що URL змінився
        cy.contains('Про нас').should('exist'); // Перевіряємо наявність тексту на новій сторінці
    });

    it('перевіряє навігацію на сторінку "Зареєструватися"', () => {
        cy.get('a').contains('Зареєструватися').click();
        cy.url().should('include', '/sign'); // Перевіряємо, що URL змінився
        cy.contains('Зареєструватися').should('exist'); // Перевіряємо наявність тексту на новій сторінці
    });

    it('перевіряє навігацію на сторінку "Наш курс"', () => {
        cy.get('a').contains('Наш курс').click();
        cy.url().should('include', '/our'); // Перевіряємо, що URL змінився
        cy.contains('Наш курс').should('exist'); // Перевіряємо наявність тексту на новій сторінці
    });

    it('перевіряє навігацію на сторінку "Увійти"', () => {
        cy.get('a').contains('Увійти').click();
        cy.url().should('include', '/log'); // Перевіряємо, що URL змінився
        cy.contains('Увійти').should('exist'); // Перевіряємо наявність тексту на новій сторінці
    });
});
