describe('LearnPage E2E Test', () => {
    beforeEach(() => {
        // Запуск сервера перед кожним тестом
        cy.visit('http://localhost:3000/learn'); // Змінити на реальний маршрут вашої LearnPage
    });

    it('перевірка наявності елементів на сторінці', () => {
        // Перевірка заголовка
        cy.contains('ОСНОВНІ ПОНЯТТЯ').should('exist');

        // Перевірка наявності кнопки "Вихід"
        cy.get('img[alt="out"]').should('exist');

        // Перевірка наявності лінків
        cy.contains('Теорія').should('exist').click();
        cy.url().should('include', 'http://localhost:3000/theory1'); // Перевірка перенаправлення на теорію

        // Перевірка наявності тексту про теорію
        cy.contains('Тут ти зможеш опанувати фундаментальні знання з Java').should('exist');

        // Повернення на LearnPage
        cy.go('back');
    });

    it('перевірка функціональності виходу', () => {
        // Клік на вихід
        cy.get('img[alt="out"]').click();

        // Перевірка перенаправлення на сторінку входу
        cy.url().should('include', 'http://localhost:3000/log');
    });

    it('перевірка доступу для неавторизованих користувачів', () => {
        // Логіка, яка перевіряє, чи перенаправляє неавторизованого користувача на сторінку входу
        cy.visit('/learn');
        cy.url().should('include', 'http://localhost:3000/log'); // Змінити на реальний маршрут
    });
});
