describe('Pact1 Component', () => {
    beforeEach(() => {
        // Відкриваємо сторінку з компонентом Pact1
        cy.visit('http://localhost:3000/pract1'); // Змініть на правильний шлях до компонента
    });
    it('має перейти на домашню сторінку, натиснувши посилання', () => {
        // Знаходимо посилання "Головна сторінка" і клікаємо на нього
        cy.get('a').contains('Головна сторінка').click();

        // Перевіряємо, що ми перейшли на головну сторінку
        cy.url().should('include', '/');
    });


    it('має дозволити вихід із системи', () => {
        cy.get('img[alt="out"]').click(); // Натискаємо на іконку виходу
        cy.on('window:alert', (str) => {
            expect(str).to.equal('Ви вийшли з акаунту.'); // Перевірка повідомлення про вихід
        });
    });
});
